Repository: ijennyRSM/noop
Catalog: Strand/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, pl, pt_pt, ru, th, zh_hans, zh_hant

source: You're carrying about %1$@ of surplus over %2$@. You've slept past your need on balance. Nicely ahead.
de: Du trägst etwa %1$@ Überschuss über %2$@. Unterm Strich hast du über deinen Bedarf geschlafen. Schön im Plus.
es: Llevas alrededor de %@ de superávit en %@. En balance, has dormido más de lo que necesitas. Vas bien adelantado.
fr: Vous portez environ %1$@ d'excédent sur %2$@. Vous avez dormi au-delà de vos besoins dans l'ensemble. Belle avance.
it: Hai circa %@ di surplus su %@. Nel complesso hai dormito più del tuo fabbisogno. Sei ben in vantaggio.
pl: Nosisz około %1$@ nadwyżki nad %2$@. W sumie przespałeś swoje potrzeby. Ładnie do przodu.
pt_pt: Está a carregar cerca de %1$@ de excedente sobre %2$@. Dormiu para além da tua necessidade em equilíbrio. Bem à frente.
ru: У вас накопилось около %1$@ избытка сна за %2$@. В целом вы спали больше нормы. Хороший запас.
th: คุณกำลังแบก %@ ส่วนเกินไว้มากกว่า %@. คุณนอนหลับเกินความจำเป็นเรื่องความสมดุลแล้ว ข้างหน้าอย่างดี.
zh_hans: 你累积了约 %@ 的盈余，时间跨度为%@。总体上你的睡眠超过了所需。领先得不错。
zh_hant: 你累積了約 %@ 的睡眠盈餘（期間：%@）。整體而言你睡得超過所需，狀態領先。

source: You're connected.
de: Du bist verbunden.
es: Estás conectado.
fr: Vous êtes connecté.
it: Sei collegato.
pl: Masz połączenie.
pt_pt: Está ligado.
ru: Вы подключены.
th: คุณเชื่อมต่อแล้ว
zh_hans: 你已连接。
zh_hant: 你已連接。

source: You're connected. NOOP is reading your Apple Watch data now. Your Charge score will spend its first week or so calibrating, then settle in.
de: Du bist verbunden. NOOP liest jetzt deine Apple-Watch-Daten. Dein Ladungswert kalibriert etwa in der ersten Woche, dann pendelt er sich ein.
es: Estás conectado. NOOP ya está leyendo los datos de tu Apple Watch. Tu puntuación de Carga pasará más o menos su primera semana calibrándose y luego se estabilizará.
fr: Vous êtes connecté. NOOP lit désormais les données de votre Apple Watch. Votre score de charge passera environ sa première semaine à se calibrer, puis se stabilisera.
it: Sei connesso. NOOP sta leggendo ora i dati del tuo Apple Watch. Il tuo punteggio di carica passerà la prima settimana circa a calibrarsi, poi si stabilizzerà.
pl: Masz połączenie. NOOP czyta teraz Twoje dane Apple Watch. Twój wynik Energia będzie przez mniej więcej pierwszy tydzień kalibrowany, a następnie się ustabilizuje.
pt_pt: Está ligado. O NOOP está agora a ler os dados do teu Apple Watch. A tua pontuação de Carga passa a primeira semana a calibrar e depois estabiliza.
ru: Вы подключены. NOOP теперь считывает данные ваших Apple Watch. Показатель Заряда будет калиброваться первую неделю или около того, а затем стабилизируется.
th: คุณเชื่อมต่อแล้ว NOOP กำลังอ่านข้อมูล Apple Watch ของคุณตอนนี้ คะแนนพลังฟื้นตัวของคุณจะใช้เวลาประมาณสัปดาห์แรกในการปรับเทียบ จากนั้นจึงปรับตัว
zh_hans: 你已连接。NOOP 现在正在读取你的 Apple Watch 数据。你的能量评分将在最初一周左右进行校准，然后稳定下来。
zh_hant: 你已連接。NOOP 現在正在讀取你的 Apple Watch 資料。你的能量評分將在最初一週左右進行校準，然後穩定下來。

source: You're in a good spot for training.
de: Du bist in einer guten Verfassung fürs Training.
es: Estás en un buen momento para entrenar.
fr: Vous êtes dans de bonnes conditions pour vous entraîner.
it: Sei nelle condizioni giuste per allenarti.
pl: Jesteś w dobrym miejscu na trening.
pt_pt: Está num bom lugar para treinar.
ru: Вы в хорошей форме для тренировки.
th: คุณอยู่ในจุดที่ดีสำหรับการฝึกอบรม
zh_hans: 你现在的状态很适合训练。
zh_hant: 你現在的狀態很適合訓練。

source: You're in balance with your baseline, so moderate strain is well-judged
de: Du bist im Gleichgewicht mit deiner Basislinie, moderate Belastung ist also gut gewählt
es: Estás en equilibrio con tu línea base, así que un esfuerzo moderado es acertado
fr: Vous êtes en équilibre avec votre référence, un effort modéré est donc bien jugé
it: Sei in equilibrio con la tua linea di base, quindi un carico moderato è una buona scelta
pl: Jesteś w równowadze ze swoją wartością wyjściową, więc umiarkowane obciążenie jest dobrze ocenione
pt_pt: Está em equilíbrio com a tua linha de base, pelo que um esforço moderado é bem avaliado
ru: Вы в балансе со своей нормой, поэтому умеренная нагрузка — верное решение
th: คุณอยู่ในสมดุลกับค่าพื้นฐาน ดังนั้นภาระร่างกายในระดับปานกลางจึงได้รับการพิจารณาอย่างดี
zh_hans: 你与基线保持平衡，适度的强度是明智之选
zh_hant: 你與基線保持平衡，中等強度是明智的選擇

source: You're offline. The coach needs a connection; everything else in NOOP keeps working.
de: Du bist offline. Der Coach benötigt eine Verbindung; alles andere in NOOP funktioniert weiter.
es: No tienes conexión. El Coach necesita conectarse; todo lo demás en NOOP sigue funcionando.
fr: Vous êtes hors ligne. Le Coach a besoin d’une connexion ; tout le reste de NOOP continue de fonctionner.
it: Sei offline. Il Coach richiede una connessione; tutto il resto di NOOP continua a funzionare.
pl: Jesteś offline. Trener potrzebuje połączenia; cała reszta NOOP działa dalej.
pt_pt: Estás offline. O Coach precisa de uma ligação; tudo o resto no NOOP continua a funcionar.
ru: Вы не в сети. Coach требуется подключение; всё остальное в NOOP продолжает работать.
th: คุณออฟไลน์อยู่ โค้ชต้องการการเชื่อมต่อ อย่างอื่นใน NOOP ยังคงทำงานต่อไป
zh_hans: 你当前离线。Coach 需要网络连接；NOOP 的其他功能仍可继续使用。
zh_hant: 你目前離線。Coach 需要網路連線；NOOP 的其他功能仍可繼續使用。

source: You're on the latest (%@).
de: Du bist auf dem neuesten Stand (%@).
es: Tienes la última versión (%@).
fr: Vous avez la dernière version (%@).
it: Hai la versione più recente (%@).
pl: Korzystasz z najnowszej wersji (%@).
pt_pt: Está no último (%@).
ru: У вас установлена последняя версия (%@).
th: คุณอยู่ในรุ่นใหม่ล่าสุด (%@)
zh_hans: 你已是最新版本（%@）。
zh_hant: 你已是最新版本（%@）。

source: You're primed. A hard session should land well today.
de: Du bist bereit. Eine harte Einheit sollte heute gut ankommen.
es: Estás a tope. Una sesión intensa debería sentarte bien hoy.
fr: Vous êtes prêt à performer. Une séance intense devrait bien passer aujourd'hui.
it: Sei al top. Una sessione intensa dovrebbe andare bene oggi.
pl: Jesteś przygotowany. Ostra sesja powinna dzisiaj zakończyć się pomyślnie.
pt_pt: Estás preparado. Uma sessão difícil deve assentar bem hoje.
ru: Вы готовы. Сегодня тяжёлая тренировка должна пройти хорошо.
th: คุณพร้อมแล้ว เซสชั่นที่ยากลำบากน่าจะจบลงด้วยดีในวันนี้
zh_hans: 你状态正佳。今天进行一次高强度训练应该会有不错的效果。
zh_hant: 你狀態正佳。今天進行一次高強度訓練應該會有不錯的效果。

source: You're roughly on top of your sleep across %@. Slept minutes balance out against your need.
de: Über %@ bist du bei deinem Schlaf ungefähr im Soll. Geschlafene Minuten gleichen sich mit deinem Bedarf aus.
es: Vas más o menos al día con tu sueño en %@. Los minutos dormidos se equilibran con tu necesidad.
fr: Vous êtes à peu près à jour sur votre sommeil sur %@. Les minutes dormies s'équilibrent avec votre besoin.
it: Sei più o meno in pari con il sonno su %@. I minuti dormiti si bilanciano con il tuo fabbisogno.
pl: Prawie nie śpisz przez %@. Minuty snu równoważą Twoje potrzeby.
pt_pt: Está quase a dormir em %@. Os minutos dormidos são equilibrados com a tua necessidade.
ru: В целом вы примерно соблюдаете норму сна за %@. Минуты сна уравновешивают вашу потребность.
th: คุณเกือบจะนอนหลับบน %@ แล้ว นาทีการนอนสมดุลกับความต้องการของคุณ
zh_hans: 在%@内你的睡眠大致跟上了节奏。实际睡眠时长与所需基本持平。
zh_hant: 在%@內你的睡眠大致跟上了需求，睡眠分鐘數與所需相抵。

source: You're sitting around your typical autonomic baseline: moderate stress, a normal, balanced day.
de: Du liegst um deine typische autonome Basislinie: moderater Stress, ein normaler, ausgeglichener Tag.
es: Estás alrededor de tu línea base autonómica típica: estrés moderado, un día normal y equilibrado.
fr: Vous êtes autour de votre référence autonome typique : stress modéré, une journée normale et équilibrée.
it: Sei intorno alla tua tipica linea di base autonomica: stress moderato, una giornata normale ed equilibrata.
pl: Siedzisz wokół typowej autonomicznej linii bazowej: umiarkowany stres, normalny, zrównoważony dzień.
pt_pt: Está sentado em torno da tua linha de base autonómica típica: stress moderado, um dia normal e equilibrado.
ru: Вы находитесь на уровне своей типичной вегетативной нормы: умеренный стресс, обычный сбалансированный день.
th: คุณกำลังนั่งอยู่บนพื้นฐานระบบอัตโนมัติทั่วไปของคุณ: ความเครียดปานกลาง วันปกติ และสมดุล
zh_hans: 你正处于典型的自主神经基线附近：压力适中，是正常、平衡的一天。
zh_hant: 你目前處於典型的自律神經基線附近：中等壓力，一個正常、平衡的日子。

source: You've banked about %1$@ of sleep debt over %2$@. Surplus nights count back against it. An earlier night or two would clear it.
de: Du hast über %2$@ etwa %1$@ Schlafdefizit angesammelt. Überschuss-Nächte zählen dagegen. Ein oder zwei frühere Nächte würden es ausgleichen.
es: Has acumulado alrededor de %@ de deuda de sueño en %@. Las noches con superávit la reducen. Una o dos noches acostándote más temprano la eliminarían.
fr: Vous avez accumulé environ %1$@ de dette de sommeil sur %2$@. Les nuits en excédent la réduisent. Une ou deux nuits plus tôt suffiraient à l'effacer.
it: Hai accumulato circa %@ di debito di sonno su %@. Le notti in surplus lo riducono. Una o due serate anticipate lo azzererebbero.
pl: Nałożyłeś około %1$@ długu snu na %2$@. Nadwyżki nocy odliczają się do tego. Wcześniejsza noc lub dwie załatwiłyby sprawę.
pt_pt: Acumulou cerca de %1$@ de dívida de sono em relação a %2$@. As noites excedentes contam contra ele. Uma ou duas noites anteriores resolveriam tudo.
ru: Вы накопили около %1$@ недосыпа за %2$@. Ночи с избытком сна засчитываются в его погашение. Одна-две более ранние ночи помогли бы его закрыть.
th: คุณได้สะสมหนี้การนอนของ %@ มากกว่า %@ คืนส่วนเกินจะนับถอยหลัง คืนก่อนหน้านี้หรือสองคืนก็จะเคลียร์ได้
zh_hans: 你累积了约 %@ 的睡眠负债，时间跨度为%@。盈余的夜晚会抵消它。早睡一两晚就能还清。
zh_hant: 你累積了約 %@ 的睡眠負債（期間：%@）。有盈餘的夜晚會抵銷它。早睡一兩晚就能還清。

source: You've been seated for about %lld min. Time to move.
de: Du sitzt seit etwa %lld Min. Zeit für Bewegung.
es: Llevas sentado unos %lld min. Hora de moverte.
fr: Vous êtes assis depuis environ %lld min. Il est temps de bouger.
it: Sei seduto da circa %lld min. È ora di muoversi.
pl: Siedzisz już od około %lld min. Czas się ruszyć.
pt_pt: Está sentado há cerca de %lld min. Hora de mudar.
ru: Вы сидите уже около %lld мин. Пора подвигаться.
th: คุณได้นั่งประมาณ %lld นาที ถึงเวลาที่จะย้าย
zh_hans: 你已经坐了约 %lld 分钟。该动一动了。
zh_hant: 你已經坐了大約 %lld 分鐘，該動一動了。

source: You've hit today's optimal strain target of %lld. Nice work — your recovery earned it.
de: Du hast dein heutiges optimales Anstrengungsziel von %lld erreicht. Stark — deine Erholung hat es ermöglicht.
es: Has alcanzado tu objetivo de esfuerzo óptimo de hoy de %lld. Bien hecho: tu recuperación se lo ha ganado.
fr: Vous avez atteint votre objectif d'effort optimal du jour de %lld. Bravo — votre récupération l'a permis.
pl: Osiągnąłeś dzisiejsze optymalne docelowe odkształcenie %lld. Niezła robota – zasłużyłeś na powrót do zdrowia.
pt_pt: Atingiu a meta de tensão ideal de hoje de %lld. Bom trabalho – a tua recuperação valeu a pena.
th: คุณทำภาระร่างกายถึงเป้าหมายที่เหมาะสมของวันนี้แล้วที่ %lld ทำได้ดีมาก ระดับการฟื้นตัวของคุณรองรับภาระนี้ได้

source: Your %@ target date has passed
de: Dein Zieldatum für %@ ist verstrichen
es: Tu fecha objetivo de %@ ha pasado
fr: Ta date cible pour %@ est passée
it: La data target %@ è trascorsa
pl: Twoja data docelowa dla celu %@ minęła
pt_pt: Sua data prevista para %@ já passou
ru: Целевая дата %@ прошла.
th: วันที่เป้าหมาย %@ ของคุณผ่านไปแล้ว
zh_hans: 您的 %@ 目标日期已过
zh_hant: 您的 %@ 目標日期已過

source: Your Apple Watch as a device
de: Deine Apple Watch als Gerät
es: Tu Apple Watch como dispositivo
fr: Votre Apple Watch en tant qu'appareil
it: Il tuo Apple Watch come dispositivo
pl: Twój Apple Watch jako urządzenie
pt_pt: O teu Apple Watch como dispositivo
ru: Ваши Apple Watch как устройство
th: Apple Watch ของคุณเป็นอุปกรณ์
zh_hans: 作为一台设备的你的 Apple Watch
zh_hant: 作為一台裝置的你的 Apple Watch

source: Your autonomic markers are skewed toward stress today. Treat it as a recovery-focused day.
de: Deine autonomen Marker neigen heute Richtung Stress. Behandle es als Tag mit Fokus auf Erholung.
es: Tus marcadores autonómicos están inclinados hacia el estrés hoy. Tómalo como un día enfocado en la recuperación.
fr: Vos marqueurs autonomes penchent vers le stress aujourd'hui. Considérez-la comme une journée axée sur la récupération.
it: Oggi i tuoi marcatori autonomici pendono verso lo stress. Trattala come una giornata dedicata al recupero.
pl: Twoje markery autonomiczne są dziś przekrzywione w stronę stresu. Potraktuj ten dzień jako dzień skupiony na regeneracji.
pt_pt: Os teus marcadores autonómicos estão direcionados ao stress hoje. Trate-o como um dia focado na recuperação.
ru: Сегодня ваши вегетативные показатели смещены в сторону стресса. Отнеситесь к этому дню как к дню восстановления.
th: เครื่องหมายระบบอัตโนมัติของคุณเบ้ไปทางความเครียดในวันนี้ ถือเป็นวันที่เน้นการฟื้นตัว
zh_hans: 你今天的自主神经指标偏向压力。把今天当作以恢复为主的一天。
zh_hant: 你今天的自律神經指標偏向壓力，把今天當作以恢復為主的一天。

source: YOUR BANDS
de: DEINE BANDS
es: TUS BANDAS
fr: VOS BANDES
it: LE TUE BAND
pl: TWOJE ZAKRESY
pt_pt: SUAS BANDAS
ru: ВАШИ ГРУППЫ
th: สายรัดของคุณ
zh_hans: 你的乐队
zh_hant: 你的樂團

source: Your bands report different numbers. Here's every source, and the one NOOP is using.
de: Deine Bänder melden unterschiedliche Zahlen. Hier ist jede Quelle und die, die NOOP verwendet.
es: Tus bandas reportan números distintos. Aquí está cada fuente, y la que NOOP está usando.
fr: Vos bracelets rapportent des chiffres différents. Voici chaque source, et celle que NOOP utilise.
it: Le tue fasce riportano numeri diversi. Ecco ogni sorgente, e quella che NOOP sta usando.
pl: Twoje zespoły zgłaszają różne liczby. Oto wszystkie źródła oraz to, którego używa NOOP.
pt_pt: As tuas bandas reportam números diferentes. Aqui estão todas as fontes e aquela que o NOOP está a usar.
ru: Ваши браслеты показывают разные числа. Вот все источники и тот, который использует NOOP.
th: สายรัดของคุณรายงานตัวเลขที่แตกต่างกัน นี่คือทุกแหล่งที่มา และแหล่งเดียวที่ NOOP ใช้อยู่
zh_hans: 你的手环报告了不同的数字。这里是每一个来源，以及 NOOP 正在使用的那一个。
zh_hant: 你的手環報告了不同的數字。這裡是每一個來源，以及 NOOP 正在使用的那一個。

source: Your bloods, BP and body numbers. Kept private, on %@.
de: Deine Blutwerte, dein Blutdruck und deine Körperwerte. Privat gehalten, auf %@.
es: Tus análisis de sangre, presión arterial y datos corporales. Privados, en %@.
fr: Vos analyses sanguines, votre tension et vos données corporelles. Gardées privées, sur %@.
it: I tuoi esami del sangue, la pressione e i parametri corporei, mantenuti privati, su %@.
pl: Twoje krwi, ciśnienie i numery ciał. Zachowane jako prywatne, na %@.
pt_pt: Os teus sangues, pressão arterial e números de corpo. Mantido em segredo, em %@.
ru: Ваши анализы крови, давление и параметры тела. Хранятся приватно, на %@.
th: เลือด BP และหมายเลขร่างกายของคุณ เก็บไว้เป็นส่วนตัวบน %@
zh_hans: 你的血液检查、血压和身体数据，私密保存，在 %@ 上。
zh_hant: 你的血液檢查、血壓和身體數據，私密保存，在 %@ 上。

source: Your cardiovascular load. NOOP turns every second of heart rate into a training-impulse using heart-rate-reserve zones (Karvonen), weights time in harder zones more heavily (Edwards / Banister), and places it on a logarithmic 0-100 scale, so easy days sit low and an all-out day approaches 100, which stays genuinely rare. A long walk with little cardio still counts, through a steps / active-energy floor.
de: Ihre Herz-Kreislauf-Belastung. NOOP wandelt jede Sekunde der Herzfrequenz unter Verwendung von Herzfrequenzreservezonen (Karvonen) in einen Trainingsimpuls um, gewichtet die Zeit in härteren Zonen stärker (Edwards/Banister) und ordnet sie auf einer logarithmischen Skala von 0 bis 100 an, sodass leichte Tage niedrig bleiben und ein Vollgastag sich der 100 nähert, was wirklich selten bleibt. Ein langer Spaziergang mit wenig Cardio zählt immer noch, durch einen Stufen-/Aktiv-Energie-Boden.
es: Tu carga cardiovascular. NOOP convierte cada segundo de frecuencia cardíaca en un impulso de entrenamiento usando zonas de reserva de frecuencia cardíaca (Karvonen), pondera más el tiempo en zonas más duras (Edwards / Banister) y lo coloca en una escala logarítmica de 0 a 100, por lo que los días fáciles se mantienen bajos y un día completo se acerca a 100, lo cual sigue siendo realmente raro. Todavía cuenta una caminata larga con poco cardio, a través de una escalera/suelo de energía activa.
fr: Votre charge cardiovasculaire. NOOP transforme chaque seconde de fréquence cardiaque en une impulsion d'entraînement en utilisant les zones de réserve de fréquence cardiaque (Karvonen), pondère plus fortement le temps passé dans les zones les plus difficiles (Edwards / Banister) et le place sur une échelle logarithmique de 0 à 100, de sorte que les journées faciles restent basses et qu'une journée complète approche les 100, ce qui reste vraiment rare. Une longue marche avec peu de cardio compte quand même, à travers un sol marches/énergie active.
it: Il tuo carico cardiovascolare. NOOP trasforma ogni secondo di frequenza cardiaca in un impulso di allenamento utilizzando le zone di riserva della frequenza cardiaca (Karvonen), pondera maggiormente il tempo trascorso nelle zone più difficili (Edwards / Banister) e lo posiziona su una scala logaritmica 0-100, in modo che i giorni facili siano bassi e un giorno a tutto campo si avvicini a 100, il che rimane veramente raro. Conta ancora una lunga camminata con poco cardio, attraverso un piano di passi/energia attiva.
pl: Twoje obciążenie sercowo-naczyniowe. NOOP zamienia każdą sekundę tętna w impuls treningowy, korzystając ze stref rezerwy tętna (Karvonen), mocniej waży czas w trudniejszych strefach (Edwards / Banister) i umieszcza wynik na logarytmicznej skali 0-100, więc dni lekkie leżą nisko, a dzień na maksa zbliża się do 100, co pozostaje naprawdę rzadkie. Długi spacer bez większego wysiłku krążeniowego również się liczy, dzięki progowi opartemu na krokach i energii aktywnej.
pt_pt: Sua carga cardiovascular. NOOP transforma cada segundo de frequência cardíaca em um impulso de treinamento usando zonas de reserva de frequência cardíaca (Karvonen), pondera mais o tempo em zonas mais difíceis (Edwards / Banister) e o coloca em uma escala logarítmica de 0 a 100, de modo que os dias fáceis ficam baixos e um dia completo se aproxima de 100, o que permanece genuinamente raro. Uma longa caminhada com pouco cardio ainda conta, através de um piso de degraus/energia ativa.
ru: Ваша сердечно-сосудистая нагрузка. NOOP превращает каждую секунду сердечного ритма в тренировочный импульс, используя резервные зоны сердечного ритма (Карвонен), уделяет больше внимания времени в более сложных зонах (Эдвардс / Банистер) и помещает его в логарифмическую шкалу от 0 до 100, поэтому легкие дни занимают мало места, а день с полной отдачей приближается к 100, что остается действительно редкостью. Долгая прогулка с небольшим количеством кардиотренировок по-прежнему имеет значение, по ступенькам/полу активной энергии.
th: ภาระระบบหัวใจและหลอดเลือดของคุณ NOOP แปลงข้อมูลอัตราการเต้นหัวใจในแต่ละวินาทีเป็นแรงกระตุ้นจากการฝึก โดยใช้โซน Heart Rate Reserve (Karvonen) และให้น้ำหนักเวลาที่อยู่ในโซนหนักมากขึ้น (Edwards / Banister) จากนั้นแสดงบนสเกลลอการิทึม 0–100 วันเบาจะมีคะแนนต่ำ ส่วนวันที่ออกแรงเต็มที่อาจเข้าใกล้ 100 ซึ่งเกิดขึ้นได้ยาก การเดินนานที่ใช้แรงหัวใจไม่มากยังนับรวมผ่านจำนวนก้าวและพลังงานจากการเคลื่อนไหว
zh_hans: 你的心血管负荷。 NOOP 使用心率储备区 (Karvonen) 将每秒的心率转化为训练脉冲，对较困难区域的时间进行更重的权重 (Edwards / Banister)，并将其置于对数 0-100 范围内，因此轻松的日子处于较低水平，全力以赴的日子接近 100，这仍然非常罕见。通过台阶/活性能量地板，进行少量有氧运动的长距离步行仍然很重要。
zh_hant: 你的心血管負荷。 NOOP 使用心率儲備區 (Karvonen) 將每秒的心率轉化為訓練脈衝，對較困難區域的時間進行更重的權重 (Edwards / Banister)，並將其置於對數 0-100 範圍內，因此輕鬆的日子處於較低水平，全力以赴的日子接近 100，這仍然非常罕見。透過階梯/活性能量地板，進行少量有氧運動的長距離步行仍然很重要。
